gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
extern bool esc_notify_flag;
extern bool start_dw_flag;
extern bool drhc_notify_flag;
extern bool cdrc_notify_flag;
extern bool rdrc_notify_flag;
static dm_application_instance_t         m_app_handle;                              /**< Application identifier allocated by device manager */

//static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE},
//                                   {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
//                                   {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};

static int pktCounter = 0;  // need change to variable

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

void flash_write_simulation(void)
{
	float cal_acc_test[3];	
		cal_acc_test[0] = 12;
		cal_acc_test[1] = 25;
		cal_acc_test[2] = 30;			
		int w_cnt = 600 * 3;
		flash_data_set_init();	
		while(w_cnt--) {
				if (w_cnt == 1000) {
					flash_data_set_write(NULL, cal_acc_test, 1, w_cnt);
				} else if (w_cnt == 500) {
					flash_data_set_write(NULL, cal_acc_test, 2, w_cnt);
				}	else {
					flash_data_set_write(NULL, cal_acc_test,0, 0);
				}	
		}
		nrf_delay_ms(100);
		pktCounter = 125;
		m_pbs.esc_s.number_of_event = 1;
		uint8_t esc_sim_data[3] = {0,0,1};
		ble_pbs_esc_update(&m_pbs, esc_sim_data);
		printf("flash write simulation\r\n");
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */

static void dhrc_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		
		// Start flash write simulation
	if (pktCounter == 0 && esc_notify_flag)
	{
		flash_write_simulation();
	}
	// Simulator flash read
		uint32_t r_xy;
		uint32_t r_z;
		uint8_t r_event_ID;
		uint32_t r_UTC;
		int ret;
		uint16_t data_x[4] = {0};
		uint16_t data_y[4] = {0};
		uint16_t data_z[4] = {0};
		uint8_t len = 0;
		uint8_t p_cal_encoded_buffer[20] = {0};
		p_cal_encoded_buffer[0] = pktCounter;
		p_cal_encoded_buffer[1] = 18;
		uint32_t err_code;
		uint8_t pktNum=0;
		if (pktCounter > 0 && cdrc_notify_flag== true && start_dw_flag)
		{
			if (pktCounter == 125) // The first data packet
				nrf_delay_ms(200);
			printf("pktCounter : %i ",pktCounter);
			pktCounter--;

			// Simulator flash read, assign to uint16_t array
			for(int i=0;i<4;i++)
			{
				ret=flash_data_set_read(NULL, NULL, &r_xy, &r_z, &r_event_ID, &r_UTC);
				data_x[i] = (uint16_t)((r_xy&0xFFFF0000)>>16);
				data_y[i] = (uint16_t)(r_xy&0xFFFF);
				data_z[i] = (uint16_t)(r_z&0xFFFF);
			}
			pktNum=0;
			// assign 4 read data value to cdrc data packet
			for (int i=2;i<20;i=i+9)
			{
				p_cal_encoded_buffer[i] = (uint8_t) (data_z[pktNum]& 0xFF) ;
				p_cal_encoded_buffer[i+1] = ((data_z[pktNum]& 0x0F00) >> 8) | ((data_y[pktNum]&0x0F) << 4);
				p_cal_encoded_buffer[i+2] = (uint8_t) ((data_y[pktNum]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+3] = (uint8_t) (data_x[pktNum]& 0xFF)  ;
				p_cal_encoded_buffer[i+4] = ((data_x[pktNum]& 0x0F00) >> 8) | ((data_z[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+5] = (uint8_t) ((data_z[pktNum+1]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+6] = (uint8_t) (data_y[pktNum+1]& 0xFF) ;
				p_cal_encoded_buffer[i+7] = ((data_y[pktNum+1]& 0x0F00) >> 8) | ((data_x[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+8] = (uint8_t) ((data_x[pktNum+1]& 0x0FF0) >> 4) ;
				pktNum += 2;
			}
			printf("ret: %i,Cal data:",ret);
			for(int i=19;i>=0;i--)
			{
				printf("%02X ",p_cal_encoded_buffer[i]);
			}
			printf("\r\n");
			err_code = ble_pbs_cdrc_update(&m_pbs, p_cal_encoded_buffer);
		}

}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
	    err_code = app_timer_create(&m_data_header_report_id,
                                APP_TIMER_MODE_REPEATED,
                                dhrc_timeout_handler);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}




/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    uint32_t       err_code;
//		ble_pbs_init_t pbs_init; //No use currently

		m_pbs.evt_handler          = NULL;
		memset(&m_pbs, 0, sizeof(m_pbs));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_attr_md.read_perm);
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_attr_md.write_perm); // Orignally no access
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_cccd_md.cccd_write_perm);
		
		// Value setting 
		//bool utc_exist_bit = false;  // bit located in m_pbs.bsc_s.flag 0x10, TBD
		m_pbs.bsc_s.flag = 0x00;
		m_pbs.bsc_s.sampling_frequency = 50;
		m_pbs.bsc_s.ble_output_power = -8;
		m_pbs.bsc_s.current_utc = 0;
		m_pbs.bsc_s.ambient_sensor_value = 0;
		m_pbs.bsc_s.acc_voltage = 0;
		
		m_pbs.tsc_s.small_accident_level_x = 70;
		m_pbs.tsc_s.small_accident_level_y = 60;
		m_pbs.tsc_s.medium_accident_level = 60;
		m_pbs.tsc_s.high_accident_level = 100;
		m_pbs.tsc_s.hard_accelaration_level = 30;
		m_pbs.tsc_s.hard_braking_level = 35;
		m_pbs.tsc_s.hard_steering_level_left = 35;
		m_pbs.tsc_s.hard_steering_level_right= 35;

		// Event Storage Characteristic default value
		m_pbs.esc_s.download_control_point = 0x00;
		m_pbs.esc_s.number_of_event = 0x00;
		// Data Report Header Characteristic default value
		m_pbs.drhc_s.recorded_data_interval = 20;
		m_pbs.drhc_s.recorded_data_resolution = 12;
		m_pbs.drhc_s.recorded_number_of_axis = 3;
		m_pbs.drhc_s.recorded_event_id = 0;
		m_pbs.drhc_s.recorded_event_duration = 10;
		m_pbs.drhc_s.recorded_utc_of_event_start = 0;
		// Calibration Data Log default value
		m_pbs.cdrc_s.data_packet_id = 0;
		m_pbs.cdrc_s.data_packet_length = 18;
		uint8_t default_cdrc_data[18] = {0};
		m_pbs.cdrc_s.data_payload = default_cdrc_data;
		// Raw Data Log default value
		m_pbs.rdrc_s.data_packet_id = 0;
		m_pbs.rdrc_s.data_packet_length = 18;
		uint8_t default_rdrc_data[18] = {0};
		m_pbs.rdrc_s.data_payload = default_rdrc_data;
		
